lighthouse_forum/app/controllers/posts_controller.rb

  def create
    @post = Post.new( post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "author", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "the best post ever"], ["author", "myself"], ["text", "All of the posts"], ["created_at", "2015-03-31 01:21:08.108784"], ["updated_at", "2015-03-31 01:21:08.108784"]]

  def update
    @post = Post.find(params[:id])

    if @post.update_attributes(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?